In [72]:
import numpy as np
import pandas as pd

In [73]:
boston_url = "https://andybek.com/pandas-marathon"

In [74]:
boston = pd.read_csv(boston_url)

In [75]:
boston.head()

,Name,Age,M/F,City,State,Country,Official Time,Overall,Gender,Years Ran
0,"Kirui, Geoffrey",24,M,Keringet,NaN,KEN,2:09:37,1,1,NaN
1,"Rupp, Galen",30,M,Portland,OR,USA,2:09:58,2,2,NaN
2,"Osako, Suguru",25,M,Machida-City,NaN,JPN,2:10:28,3,3,NaN
3,"Biwott, Shadrack",32,M,Mammoth Lakes,CA,USA,2:12:08,4,4,NaN
4,"Chebet, Wilson",31,M,Marakwet,NaN,KEN,2:12:35,5,5,2015

In [76]:
boston.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           1000 non-null   object
 1   Age            1000 non-null   int64
 2   M/F            1000 non-null   object
 3   City           1000 non-null   object
 4   State          807 non-null    object
 5   Country        1000 non-null   object
 6   Official Time  1000 non-null   object
 7   Overall        1000 non-null   int64
 8   Gender         1000 non-null   int64
 9   Years Ran      315 non-null    object
dtypes: int64(3), object(7)
memory usage: 78.2+ KB

# Agenda
- len
- center
- startswith , endswith
- the "in"  operator
- list comprehension

In [77]:
# len
# this describes the lenght of the string
len('the boy cannot go home')

22

In [78]:
# center
d = 'the boy can do it'

In [79]:
d.center(40, '>')

'>>>>>>>>>>>the boy can do it>>>>>>>>>>>>'

In [80]:
#starts with
d.startswith('t'), d.endswith('t')

(True, True)

In [81]:
# in operator, either way
'f' in d  , d in 'f'

(False, False)

In [82]:
# the list comprehension

In [83]:
names = ['anna', 'welbeck', 'ronaldo','zlatan','kiki']

In [84]:
# run a program to return their length
lengths = []
for name in names:
    print(len(name))

4
7
7
6
4

In [85]:
[len(name) for name in names]

[4, 7, 7, 6, 4]

In [86]:
import string

In [87]:
from string import ascii_lowercase

In [88]:
t = ascii_lowercase

In [89]:
t

'abcdefghijklmnopqrstuvwxyz'

In [90]:
# run a program to check if each name starts with a
lengths = []
for name in names:
    print(name.startswith('r'))

False
False
True
False
False

In [91]:
[name.startswith('r') for name in names]

[False, False, True, False, False]

In [92]:
boston.head()

,Name,Age,M/F,City,State,Country,Official Time,Overall,Gender,Years Ran
0,"Kirui, Geoffrey",24,M,Keringet,NaN,KEN,2:09:37,1,1,NaN
1,"Rupp, Galen",30,M,Portland,OR,USA,2:09:58,2,2,NaN
2,"Osako, Suguru",25,M,Machida-City,NaN,JPN,2:10:28,3,3,NaN
3,"Biwott, Shadrack",32,M,Mammoth Lakes,CA,USA,2:12:08,4,4,NaN
4,"Chebet, Wilson",31,M,Marakwet,NaN,KEN,2:12:35,5,5,2015

In [93]:
# you need the .str to access the len of texts in pandas
# lets add a column for the length of the names
boston['len_Name'] = boston.Name.str.len()

In [94]:
boston = boston.reindex(['Name','len_Name','Age','M/F','City', 'State', 'Country', 'Official Time', 'Overall','Gender', 'Years Ran' ],axis =1)

In [95]:
[column for column in boston.columns]

['Name',
 'len_Name',
 'Age',
 'M/F',
 'City',
 'State',
 'Country',
 'Official Time',
 'Overall',
 'Gender',
 'Years Ran']

In [96]:
boston

,Name,len_Name,Age,M/F,City,State,Country,Official Time,Overall,Gender,Years Ran
0,"Kirui, Geoffrey",17,24,M,Keringet,NaN,KEN,2:09:37,1,1,NaN
1,"Rupp, Galen",14,30,M,Portland,OR,USA,2:09:58,2,2,NaN
2,"Osako, Suguru",15,25,M,Machida-City,NaN,JPN,2:10:28,3,3,NaN
3,"Biwott, Shadrack",16,32,M,Mammoth Lakes,CA,USA,2:12:08,4,4,NaN
4,"Chebet, Wilson",14,31,M,Marakwet,NaN,KEN,2:12:35,5,5,2015
...,...,...,...,...,...,...,...,...,...,...,...
995,"Larosa, Mark",12,38,M,North Andover,MA,USA,2:56:06,996,940,2015:2016
996,"Williamson, Jerry A",19,43,M,Raleigh,NC,USA,2:56:06,997,941,2015
997,"Mccue, Daniel T",15,40,M,Arlington,MA,USA,2:56:06,998,942,NaN
998,"Larosa, John",12,35,M,Danbury,CT,USA,2:56:07,999,943,NaN
999,"Sanchez, Sam R",14,35,M,Santa Fe,NM,USA,2:56:08,1000,944,NaN

# Agenda
- title( )
- upper( )
- lower( )
- swapcase( )
- capitalize( )

In [97]:
boston.City.str.capitalize()

0           Keringet
1           Portland
2       Machida-city
3      Mammoth lakes
4           Marakwet
           ...
995    North andover
996          Raleigh
997        Arlington
998          Danbury
999         Santa fe
Name: City, Length: 1000, dtype: object

# Agenda
- find( )
- rfind ( )

In [98]:
" The mountain for redemption sis allwwksnksh ".rfind('demp')

20

In [99]:
# how many top marathon runner have "nd" in their names
boston.Name.str.center(30,"|")

0      |||||| Kirui, Geoffrey |||||||
1      ||||||||Rupp, Galen   ||||||||
2      |||||||Osako, Suguru  ||||||||
3      |||||||Biwott, Shadrack|||||||
4      ||||||||Chebet, Wilson||||||||
                    ...
995    |||||||||Larosa, Mark|||||||||
996    |||||Williamson, Jerry A||||||
997    |||||||Mccue, Daniel T||||||||
998    |||||||||Larosa, John|||||||||
999    ||||||||Sanchez, Sam R||||||||
Name: Name, Length: 1000, dtype: object

# Agenda
- isspace( )
- lstrip( )
- rstrip( )
-strip( )

In [100]:
r =' \t'

In [101]:
r.isspace()

True

In [102]:
' hirir'.lstrip()

'hirir'

In [103]:
boston.Name = boston.Name.str.strip()

In [104]:
boston.Name.str.isspace().value_counts()

False    1000
Name: Name, dtype: int64

# Agenda
- split ( )
- get( )
- cat ( )

In [105]:
q = "How can I get my own personalized email address?"

In [106]:
q.strip()

'How can I get my own personalized email address?'

In [107]:
q.split(" ")

['How', 'can', 'I', 'get', 'my', 'own', 'personalized', 'email', 'address?']

In [108]:
# split firstname and lastname
boston['firstname'] = boston.Name.str.split(", ",).str.get(0)
boston['lastname'] = boston.Name.str.split(", ",).str.get(1)

In [109]:
boston.firstname.str.cat(boston.lastname, sep=" ")

0          Kirui Geoffrey
1              Rupp Galen
2            Osako Suguru
3         Biwott Shadrack
4           Chebet Wilson
              ...
995           Larosa Mark
996    Williamson Jerry A
997        Mccue Daniel T
998           Larosa John
999         Sanchez Sam R
Name: firstname, Length: 1000, dtype: object

In [110]:
 "The man, Mr.Baldwin".split(", ")[1][:2]

'Mr'

In [111]:
# boston.drop('lastnamename',axis =1, inplace = True)

In [112]:
boston.head()

,Name,len_Name,Age,M/F,City,State,Country,Official Time,Overall,Gender,Years Ran,firstname,lastname
0,"Kirui, Geoffrey",17,24,M,Keringet,NaN,KEN,2:09:37,1,1,NaN,Kirui,Geoffrey
1,"Rupp, Galen",14,30,M,Portland,OR,USA,2:09:58,2,2,NaN,Rupp,Galen
2,"Osako, Suguru",15,25,M,Machida-City,NaN,JPN,2:10:28,3,3,NaN,Osako,Suguru
3,"Biwott, Shadrack",16,32,M,Mammoth Lakes,CA,USA,2:12:08,4,4,NaN,Biwott,Shadrack
4,"Chebet, Wilson",14,31,M,Marakwet,NaN,KEN,2:12:35,5,5,2015,Chebet,Wilson

In [113]:
# merge Age and Gender

In [114]:
# how many names has Janes as Last name
boston.lastname[boston.lastname.str.contains('James')].value_counts()

James       5
James L     1
James P     1
James A     1
James P.    1
James B     1
James D.    1
James R     1
Name: lastname, dtype: int64

In [115]:
# how many names has Janes as Last name
boston.lastname.str.find('James').value_counts()

-1    988
 0     12
Name: lastname, dtype: int64

In [116]:
boston['City2'] =boston.City.str.split("-").str.get(1)
boston['City1'] =boston.City.str.split("-").str.get(0)

In [117]:
boston

,Name,len_Name,Age,M/F,City,State,Country,Official Time,Overall,Gender,Years Ran,firstname,lastname,City2,City1
0,"Kirui, Geoffrey",17,24,M,Keringet,NaN,KEN,2:09:37,1,1,NaN,Kirui,Geoffrey,NaN,Keringet
1,"Rupp, Galen",14,30,M,Portland,OR,USA,2:09:58,2,2,NaN,Rupp,Galen,NaN,Portland
2,"Osako, Suguru",15,25,M,Machida-City,NaN,JPN,2:10:28,3,3,NaN,Osako,Suguru,City,Machida
3,"Biwott, Shadrack",16,32,M,Mammoth Lakes,CA,USA,2:12:08,4,4,NaN,Biwott,Shadrack,NaN,Mammoth Lakes
4,"Chebet, Wilson",14,31,M,Marakwet,NaN,KEN,2:12:35,5,5,2015,Chebet,Wilson,NaN,Marakwet
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,"Larosa, Mark",12,38,M,North Andover,MA,USA,2:56:06,996,940,2015:2016,Larosa,Mark,NaN,North Andover
996,"Williamson, Jerry A",19,43,M,Raleigh,NC,USA,2:56:06,997,941,2015,Williamson,Jerry A,NaN,Raleigh
997,"Mccue, Daniel T",15,40,M,Arlington,MA,USA,2:56:06,998,942,NaN,Mccue,Daniel T,NaN,Arlington
998,"Larosa, John",12,35,M,Danbury,CT,USA,2:56:07,999,943,NaN,Larosa,John,NaN,Danbury
999,"Sanchez, Sam R",14,35,M,Santa Fe,NM,USA,2:56:08,1000,944,NaN,Sanchez,Sam R,NaN,Santa Fe

In [118]:
boston = boston.reindex(['Name','len_Name','Age','M/F','City',"City1" ,"City2",'State', 'Country', 'Official Time', 'Overall','Gender', 'Years Ran' ],axis =1)

In [119]:
boston.head()

,Name,len_Name,Age,M/F,City,City1,City2,State,Country,Official Time,Overall,Gender,Years Ran
0,"Kirui, Geoffrey",17,24,M,Keringet,Keringet,NaN,NaN,KEN,2:09:37,1,1,NaN
1,"Rupp, Galen",14,30,M,Portland,Portland,NaN,OR,USA,2:09:58,2,2,NaN
2,"Osako, Suguru",15,25,M,Machida-City,Machida,City,NaN,JPN,2:10:28,3,3,NaN
3,"Biwott, Shadrack",16,32,M,Mammoth Lakes,Mammoth Lakes,NaN,CA,USA,2:12:08,4,4,NaN
4,"Chebet, Wilson",14,31,M,Marakwet,Marakwet,NaN,NaN,KEN,2:12:35,5,5,2015

# String Replacement

In [120]:
ter = "Urban population (% of total) Urban population refers to people living in urban areas as defined by national statistical offices"

In [121]:
ter.replace("Urban", "City")

'City population (% of total) City population refers to people living in urban areas as defined by national statistical offices'

In [122]:
boston.sample(10)

,Name,len_Name,Age,M/F,City,City1,City2,State,Country,Official Time,Overall,Gender,Years Ran
833,"Borgen, André",13,29,M,Oslo,Oslo,NaN,NaN,NOR,2:54:04,834,787,NaN
639,"Aramaki, Yuzo",13,37,M,Cos Cob,Cos Cob,NaN,CT,USA,2:51:00,640,600,2015
147,"Costello, Liz",13,29,F,Brighton,Brighton,NaN,MA,USA,2:38:21,148,18,NaN
538,"Shingleton, Jeremy",18,38,M,New York,New York,NaN,NY,USA,2:49:24,539,502,NaN
594,"Sheaff, Spencer T",17,26,M,San Francisco,San Francisco,NaN,CA,USA,2:50:06,595,557,NaN
752,"Becker, Aaron",13,26,M,Noblesville,Noblesville,NaN,IN,USA,2:52:53,753,709,2016
628,"Starbuck, Ryan",14,32,M,Denver,Denver,NaN,CO,USA,2:50:48,629,589,2015:2016
310,"Rabe, Michael",13,37,M,Anchorage,Anchorage,NaN,AK,USA,2:44:31,311,284,NaN
676,"Collick, Neal",13,37,M,Negaunee,Negaunee,NaN,MI,USA,2:51:44,677,637,2016
942,"Lizotte, Megan L.",17,33,F,San Diego,San Diego,NaN,CA,USA,2:55:26,943,52,NaN

In [123]:
# replaceM with male and f with female
boston["M/F"].str.replace("M","Male").str.replace("F", "Female").value_counts()

Male      944
Female     56
Name: M/F, dtype: int64

In [124]:
boston

,Name,len_Name,Age,M/F,City,City1,City2,State,Country,Official Time,Overall,Gender,Years Ran
0,"Kirui, Geoffrey",17,24,M,Keringet,Keringet,NaN,NaN,KEN,2:09:37,1,1,NaN
1,"Rupp, Galen",14,30,M,Portland,Portland,NaN,OR,USA,2:09:58,2,2,NaN
2,"Osako, Suguru",15,25,M,Machida-City,Machida,City,NaN,JPN,2:10:28,3,3,NaN
3,"Biwott, Shadrack",16,32,M,Mammoth Lakes,Mammoth Lakes,NaN,CA,USA,2:12:08,4,4,NaN
4,"Chebet, Wilson",14,31,M,Marakwet,Marakwet,NaN,NaN,KEN,2:12:35,5,5,2015
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,"Larosa, Mark",12,38,M,North Andover,North Andover,NaN,MA,USA,2:56:06,996,940,2015:2016
996,"Williamson, Jerry A",19,43,M,Raleigh,Raleigh,NaN,NC,USA,2:56:06,997,941,2015
997,"Mccue, Daniel T",15,40,M,Arlington,Arlington,NaN,MA,USA,2:56:06,998,942,NaN
998,"Larosa, John",12,35,M,Danbury,Danbury,NaN,CT,USA,2:56:07,999,943,NaN
999,"Sanchez, Sam R",14,35,M,Santa Fe,Santa Fe,NaN,NM,USA,2:56:08,1000,944,NaN

# Case insentitive replacement

# we wanna replace USA with United states

In [125]:
boston.Country.str.replace("USA", "United States",case= False)

0                KEN
1      United States
2                JPN
3      United States
4                KEN
           ...
995    United States
996    United States
997    United States
998    United States
999    United States
Name: Country, Length: 1000, dtype: object

# Regular Expressions

In [126]:
import re

In [135]:
email = 'godwin.nwalozie@gmail.com'

In [136]:
pattern = r"\w\S*@.\w"

In [137]:
re.findall(pattern,email)

['godwin.nwalozie@gm']

In [156]:
boston.Name[boston.Name.str.contains(r',\s[Ww]ill$', regex= True)]

456      Cunha, Will
526    Swenson, Will
835     Vargas, Will
892     Rivera, Will
Name: Name, dtype: object

In [158]:
boston.dtypes

Name             object
len_Name          int64
Age               int64
M/F              object
City             object
City1            object
City2            object
State            object
Country          object
Official Time    object
Overall           int64
Gender            int64
Years Ran        object
dtype: object

# split official time into three columns for hour, minutes and seconds

In [172]:
Official_Time_split= boston['Official Time'].str.split(":", expand = True).rename({0:'Hour', 1: "Minute",2: 'Seconds'},axis = 1)

In [174]:
pd.concat([boston,Official_Time_split],axis =1)

,Name,len_Name,Age,M/F,City,City1,City2,State,Country,Official Time,Overall,Gender,Years Ran,Hour,Minute,Seconds
0,"Kirui, Geoffrey",17,24,M,Keringet,Keringet,NaN,NaN,KEN,2:09:37,1,1,NaN,2,09,37
1,"Rupp, Galen",14,30,M,Portland,Portland,NaN,OR,USA,2:09:58,2,2,NaN,2,09,58
2,"Osako, Suguru",15,25,M,Machida-City,Machida,City,NaN,JPN,2:10:28,3,3,NaN,2,10,28
3,"Biwott, Shadrack",16,32,M,Mammoth Lakes,Mammoth Lakes,NaN,CA,USA,2:12:08,4,4,NaN,2,12,08
4,"Chebet, Wilson",14,31,M,Marakwet,Marakwet,NaN,NaN,KEN,2:12:35,5,5,2015,2,12,35
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,"Larosa, Mark",12,38,M,North Andover,North Andover,NaN,MA,USA,2:56:06,996,940,2015:2016,2,56,06
996,"Williamson, Jerry A",19,43,M,Raleigh,Raleigh,NaN,NC,USA,2:56:06,997,941,2015,2,56,06
997,"Mccue, Daniel T",15,40,M,Arlington,Arlington,NaN,MA,USA,2:56:06,998,942,NaN,2,56,06
998,"Larosa, John",12,35,M,Danbury,Danbury,NaN,CT,USA,2:56:07,999,943,NaN,2,56,07
999,"Sanchez, Sam R",14,35,M,Santa Fe,Santa Fe,NaN,NM,USA,2:56:08,1000,944,NaN,2,56,08